import math

a = 1
b = 9
c = 20
delta = b ** 2 - 4 * a * c
print((-b + math.sqrt(delta)) / (2 * a))
print((-b - math.sqrt(delta)) / (2 * a))

# 注释
# ༼ つ ◕_◕ ༽つ 佛祖护体
#          _ooOoo_
#         o8888888o
#         88" . "88
#         (| -_- |)
#          O\ = /O
#      ____/`---'\____
#    .'  \\|     |//  `.
#   /  \\|||  :  |||//  \
#  /  _||||| -:- |||||-  \
#  |   | \\\  -  /// |   |
#  | \_|  ''\---/''  |   |
#  \  .-\__  `-`  ___/-. /
#___`. .'  /--.--\  `. . __
#."" '<  `.___\_<|>_/___.'  >'"".
#| | :  `- \`.;`\ _ /`;.`/ - ` : | |
#\  \ `-.   \_ __\ /__ _/   .-` /  /
#======`-.____`-.___\_____/___.-`____.-'======
#                   `=---='
# ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
#           佛祖保佑        永无BUG
#           代码上线        一路绿灯
#           需求不变        测试全过

# 对字符串求长度
s = "Hello world!"
print(len(s))

# 通过索引获取单个字符
print(s[0])
print(s[len(s) - 1])

# 布尔类型
b1 = True
b2 = False

# 空值类型
n = None

# type函数
print(type(s))
print(type(b1))
print(type(n))
print(type(1.5))

# 不能对布尔类型的变量使用len函数，因此下面一行会报错
# len(b1)

